nestedData = [
  {
    "name": "ДоННУ",
    "subOptions": [
      {
        "name": "Факультет інформаційних і прикладних технологій",
        "subOptions": [
          {
            "name": "Кафедра журналістики",
            "subOptions": [{"name": "...", subOptions: [{"name": "...", subOptions: []}]}]
          },
          {
            "name": "Кафедра інформаційних систем управління",
            "subOptions": []
          },
          {
            "name": "Кафедра комп’ютених наук та інформаційних технологій",
            "subOptions": []
          },
          {
            "name": "Кафедра політології та державного управління",
            "subOptions": []
          },
          {
            "name": "Кафедра прикладної математики",
            "subOptions": []
          },
          {
            "name": "Кафедра радіофізики та кібербезпеки",
            "subOptions": []
          }
        ]
      },
      {
        "name": "Факультет історії та міжнародних відносин",
        "subOptions": [
          {
            "name": "Кафедра історії України та спеціальних галузей історичної науки",
            "subOptions": []
          },
          {
            "name": "Кафедра всесвітньої історії та археології",
            "subOptions": []
          },
          {
            "name": "Кафедра міжнародних відносин і зовнішньої політики",
            "subOptions": []
          },
          {
            "name": "Кафедра філософії",
            "subOptions": []
          }
        ]
      },
      {
        "name": "Філологічний факультет",
        "subOptions": [
          {
            "name": "Кафедра загального та прикладного мовознавства і слов’янської філології",
            "subOptions": []
          },
          {
            "name": "Кафедра теорії та історії української і світової літератури",
            "subOptions": []
          },
          {
            "name": "Кафедра української мови і культури",
            "subOptions": []
          },
          {
            "name": "Кафедра психології",
            "subOptions": []
          }
        ]
      },
      {
        "name": "Факультет іноземних мов",
        "subOptions": [
          {
            "name": "Кафедра теорії і практики перекладу",
            "subOptions": []
          },
          {
            "name": "Кафедра германської філології",
            "subOptions": []
          },
          {
            "name": "Кафедра англійської філології",
            "subOptions": []
          },
          {
            "name": "Кафедра іноземних мов професійного спрямування",
            "subOptions": []
          },
          {
            "name": "Кафедра романських мов і світової літератури",
            "subOptions": []
          }
        ]
      },
      {
        "name": "Економічний факультет",
        "subOptions": [
          {
            "name": "Кафедра економічної та управлінської аналітики",
            "subOptions": []
          },
          {
            "name": "Кафедра обліку, аналізу і аудиту",
            "subOptions": []
          },
          {
            "name": "Кафедра фінансів та банківської справи",
            "subOptions": []
          },
          {
            "name": "Кафедра менеджменту та  поведінкової  економіки",
            "subOptions": []
          },
          {
            "name": "Кафедра маркетингу",
            "subOptions": []
          },
          {
            "name": "Кафедра підприємництва, корпоративної та просторової економіки",
            "subOptions": []
          },
          {
            "name": "Кафедра міжнародних економічних відносин",
            "subOptions": []
          }
        ]
      },
      {
        "name": "Юридичний факультет",
        "subOptions": [
          {
            "name": "Кафедра господарського права",
            "subOptions": []
          },
          {
            "name": "Кафедра цивільного права і процесу",
            "subOptions": []
          },
          {
            "name": "Кафедра теорії та історії держави і права та адміністративного права",
            "subOptions": []
          },
          {
            "name": "Кафедра конституційного, міжнародного і кримінального права",
            "subOptions": []
          }
        ]
      },
      {
        "name": "Факультет хімії, біології і біотехнологій",
        "subOptions": [
          {
            "name": "Кафедра біофізичної хімії і нанобіотехнологій",
            "subOptions": []
          },
          {
            "name": "Кафедра неорганічної, органічної та аналітичної хімії",
            "subOptions": []
          },
          {
            "name": "Навчально-науковий центр експериментальної хімії",
            "subOptions": []
          },
          {
            "name": "Кафедра ботаніки та екології",
            "subOptions": []
          },
          {
            "name": "Кафедра біофізики і фізіології",
            "subOptions": []
          },
          {
            "name": "Кафедра педагогіки, фізичної культури та управління освітою",
            "subOptions": []
          }
        ]
      }
    ]
  }
]